Firma/nalog_encrypted_and_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns2:getNalogZaPlacanjeRequest xmlns:ns2="http://nalogZaPlacanje.xml.com" xmlns:ns3="http://zahtevzadobijanjeizvoda.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>h2N331QU2f1N44fhQZX5Gzo+YWKMXRF0Qn7ZjFPd1NOpMMyAYz6GJTWM14fiWXVu/4Vr5acjbKSy&#13;
9AJ7eJvVmNWXa8QStbiVQ3bEM9+JJUfK5BGKAsBwH6OkJnKy99w3ilzPfNCJlZ1vmixdFcyJ+u/4&#13;
tFgEuA7XauVWFH/+WCPSsioz+ZBwAHsqI1mX75YOMdCkE/VDWjrMGvWZ5DOADFR/dH9RzWDlGKNO&#13;
c9ShFp6Jgc0EZbjcLYcS61jgvIYno7RrDg++M5WX4FYOooslNfZhT6/8uePHRkhYhgpLGO1kWUvg&#13;
7BFwtYouABbq7y2DZoyO0m2UFeDyC9aHKZ8JaA==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>RWIbx4WyHVCZhcESB2ehKUjFe6GssCy+TV3GiDtf6Obx405Az+AaTlOUyWATC1oDjx5xS788cB07&#13;
3mdDnCKHg+CIRgEFZtC4Ij/Vm0oq//8rPDFBE7CXwGnOe1xfhvFzwFoQjqJuHgSD2OEtdZV4+GlA&#13;
7kwHXKEyWEiguuacLPpErwpmpG3+sCZa0vSPfJIZhHgAStOp4n3yyvyVrNES/OPABlTxjIVKLdMi&#13;
kkxPtthRz1gaNAd8CTrSdrHVtNVAykp/ZR9aubcT77oztm7/5IAJyOotieCIhJOjYNSTMTMFem3e&#13;
DKXcf+bkkqm74+Lo4KzoO4GTnPVMwdKfvDFYLeVQBLokyF8wQw1kbvwQc/UVCN85FnHBFVy8ERmU&#13;
2sIZ7YGyXnWZVfo8eHYjclOowVENeCU+pt/c3APrIMaNqJz+R7czB3N6rK4XBSLhFB0xARhXi1HK&#13;
1Vu/beFeUQinJXMRpu+zICwAJlkOrRBlgGE5kmS+FFlJqQrA4dTJZPsFpMies5YHEKeybayOQQAh&#13;
N3/JZLQCxN8DxqB6qium2DqFkKWMcOFRUxeFIKm0Xi/zvYfpNDDTAld7GGjrB9e1y5OLyXpN9akh&#13;
0t4WJvb62uvwx9GNT1D1yUkCaDQkxoLjFBhi3jG630RkOgylcqnEaEg2RMLKAP7lJ046y2+Pi6ri&#13;
o/hX5lboaXhpNWn4JzVLGxw9EJ+ObfZCZeOmx0f/YK2oqu/3jXeBdjyaazYc0JLGFP0kRB8B0Vq7&#13;
36maaYITVSMORjHkPpXtmfgqz7NLfgsjzWW1k9xf0aDacynwsrkfXxNPWffLLtuixvjrJ6H8wTLJ&#13;
BMAggNk1Sy5NmRaYcSVEn49SQPGZaTSk5CXiTSyOSEenWe71aQN/dY0TpoyRuPefFycByzH7ovt2&#13;
dL0R8mk4/OnOz5AltUFB/bNmyvIAZz7YGD9p0Fn5qnN89nOt</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns2:getNalogZaPlacanjeRequest></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>7jPHEq7MwRkGdgav+axeB5OafUg=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
QfS2gwbNeRk1IvEjWci/ILp7blUptUXDr5vGmiFA/PHkOKXNkLqvcef0PsH9iw79rSh6kMbWoMGa&#13;
7eBbkq5RZbUlbgt7cSmC6o+cauOpHZaNJ85Hmz5542xx/2htBysYePXCs3s5IcTJkgUSA8QP8pz9&#13;
OcO7Y/pYRXuF57tgn9zbyfuIvINirXtcdicP7qbBTLKkfpXt7dOH7f4aDi3IiA+Aqtz2sjjsLiQI&#13;
izgE3lY+vjgcZGLOSG5RT4NKZgGqTAM9aM+ZHJ1F2SBmarRVastlo7lxwGLYyPi1voYIRmZysYCV&#13;
bhrNFWQQg6rHGu+al9pVoCqv3VgT91unmjJtRg==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
qvq9L4TdlpRND/aAnYa969IckeVyjGtDV1DHs/GvtFYRHuW6giXxjm3SUtVtTQoRTIoqBSLfpMBe&#13;
JODaAh6rACQpAgWymU4pbRXz7UIPhhpkyNeEXwtl63ILNOtIj6bMGtKnj6cmMYzNvUoQBixbFTSg&#13;
ixi3O996Z/YvRQLgW1obxiooCBoZuFEnFlfcUzCtHE5XmvZUWs4EjNA/oj9H2rJ34SMBz89XNyTl&#13;
0TBQh4ZPYw0WxzDJAyrtAGLWaPq1vOyA8PnXX33kQHGB7ZJVTVDlsFoD3ftWYQ63/LPshqM3P8BE&#13;
/uav8luUhVcVRDCDfvvpvmmJSVi7fK0zY4QQ7Q==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDgjCCAmqgAwIBAgIEWUhRPjANBgkqhkiG9w0BAQsFADB6MRAwDgYDVQQDDAdCYW5rYSBBMRAw&#13;
DgYDVQQKDAdCYW5rYSBBMQ4wDAYDVQQLDAVCYW5rYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcN&#13;
AQkBFgtiYW5rYUBhLmNvbTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0OTIwHhcNMTcwNjE5MDAw&#13;
MDAwWhcNMTgwNjE5MDAwMDAwWjB6MRAwDgYDVQQDDAdGaXJtYSBBMRAwDgYDVQQKDAdGaXJtYSBB&#13;
MQ4wDAYDVQQLDAVGaXJtYTEMMAoGA1UEBhMDc3JiMRowGAYJKoZIhvcNAQkBFgtmaXJtYUBhLmNv&#13;
bTEaMBgGCgmSJomT8ixkAQEMCjE0OTc5MTE2MTQwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEK&#13;
AoIBAQCq+r0vhN2WlE0P9oCdhr3r0hyR5XKMa0NXUMez8a+0VhEe5bqCJfGObdJS1W1NChFMiioF&#13;
It+kwF4k4NoCHqsAJCkCBbKZTiltFfPtQg+GGmTI14RfC2Xrcgs060iPpswa0qePpyYxjM29ShAG&#13;
LFsVNKCLGLc733pn9i9FAuBbWhvGKigIGhm4UScWV9xTMK0cTlea9lRazgSM0D+iP0fasnfhIwHP&#13;
z1c3JOXRMFCHhk9jDRbHMMkDKu0AYtZo+rW87IDw+ddffeRAcYHtklVNUOWwWgPd+1ZhDrf8s+yG&#13;
ozc/wET+5q/yW5SFVxVEMIN+++m+aYlJWLt8rTNjhBDtAgMBAAGjEDAOMAwGA1UdEwEB/wQCMAAw&#13;
DQYJKoZIhvcNAQELBQADggEBABPql7l2SOkUU7ON9SEqNswIVn+RyAL+Y/9OBJ+0aU0lcvpgbFNZ&#13;
5GsCMufSLRK0z1HU2rKW969FAnxAbfvMAvTh8a1VKuSF1P259bjFSoCekPfDW8irKtdBwlXUQtfn&#13;
Av2mVWLhk9XhBQtN78BktFLuXG7aRfbgb6L/e9M6Z1XFM8QK5WzBo1Y/7C7js7R0thIX9OsBs0gD&#13;
yoK644NxtAH2JljgqREpcjKZwNhfXZ++SIK8O5zUM7hlo1C7N1XqkURhc7J5ADRIHf5cOJCqiE6d&#13;
Q2WnEbguq2W6D5tTN/qjfkOtu1AWa29vz3O2piue9WkfIqxC84/llz20jrIWfow=
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>